Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO LibreIM, casi cinco años después                                                       :post:
:PROPERTIES:
:TITLE: LibreIM, casi cinco años después
:EXPORT_FILE_NAME: libreimquintoaniversario.html
:INDEX_DATE: <2018-09-03 Mon 21:54>
:END:

Tengo un correo de diciembre de 2013 en el que David Charte consiguió
meter un foro de Moot en una página de Github. En julio de 2014 entre
Nacho Cordón, David Charte y yo perfilamos la idea de reunirnos en la
facultad; tuvimos mucha ayuda del departamento de álgebra; y el 27 de
septiembre de 2014 a las 10:00 en el A13 de Ciencias empezamos el
primer seminario, sobre teoría de categorías y Haskell, con Pablo
Baeyens en la segunda parte.

Llevamos 48 seminarios, y la asistencia ha ido creciendo poco a poco.
Me hace cierta ilusión que, aun con algún problema que otro, haya
funcionado.  Mientras sirvan para seguir poniendo ideas en común y
siga habiendo gente dispuesta a ir y a prepararlos, son una
herramienta muy útil para tener en un grado.  Han servido para
conocer un montón de gente con ganas de explorar y compartir las
matemáticas y la informática.  Y la comunidad motiva mucho; el doble
grado hubiera sido muy árido de otra forma.

No sé muy bien cómo hemos llegado a este equilibrio en el que el
comportamiento por defecto es compartir, pero creo que se ha arraigado
bien en el doble grado y merece mucho la pena cuidarlo.  Estaría muy
orgulloso de todo esto si colectivamente conseguimos mantenerlo en un
futuro.


