libreimquintoaniversario.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-23 Sun 15:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LibreIM, casi cinco años después</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">LibreIM, casi cinco años después</h1>
<p>
Tengo un correo de diciembre de 2013 en el que David Charte consiguió
meter un foro de Moot en una página de Github. En julio de 2014 entre
Nacho Cordón, David Charte y yo perfilamos la idea de reunirnos en la
facultad; tuvimos mucha ayuda del departamento de álgebra; y el 27 de
septiembre de 2014 a las 10:00 en el A13 de Ciencias empezamos el
primer seminario, sobre teoría de categorías y Haskell, con Pablo
Baeyens en la segunda parte.
</p>

<p>
Llevamos 48 seminarios, y la asistencia ha ido creciendo poco a poco.
Me hace cierta ilusión que, aun con algún problema que otro, haya
funcionado.  Mientras sirvan para seguir poniendo ideas en común y
siga habiendo gente dispuesta a ir y a prepararlos, son una
herramienta muy útil para tener en un grado.  Han servido para
conocer un montón de gente con ganas de explorar y compartir las
matemáticas y la informática.  Y la comunidad motiva mucho; el doble
grado hubiera sido muy árido de otra forma.
</p>

<p>
No sé muy bien cómo hemos llegado a este equilibrio en el que el
comportamiento por defecto es compartir, pero creo que se ha arraigado
bien en el doble grado y merece mucho la pena cuidarlo.  Estaría muy
orgulloso de todo esto si colectivamente conseguimos mantenerlo en un
futuro.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2018-09-03 Mon 21:54. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
